Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །གང་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གནས་པར་འགྱུར་བའི་ཚོར་བ་དང་། འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་ངོ་བོ་ཉིད་མེད་དོ།
en: There is no essential nature of feelings, perceptions, formative predispositions, or consciousness in which bodhisattva great beings could be established.

source: །གང་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གནས་པར་འགྱུར་བའི་སྐྱེ་མཆེད་དང་། ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་ངོ་བོ་ཉིད་མེད་དོ།
en: There is no essential nature of the sense fields, the sensory elements, or the links of dependent origination in which bodhisattva great beings could be established.

source: །གང་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གནས་པར་འགྱུར་བའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་གྱི་ངོ་བོ་ཉིད་མེད་དོ།
en: There is no essential nature of any of the perfections, any of the aspects of emptiness, or the thirty-seven factors conducive to enlightenment in which bodhisattva great beings could be established.

source: །གང་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གནས་པར་འགྱུར་བའི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་གྱི་ངོ་བོ་ཉིད་མེད་དོ།
en: There is no essential nature of [any of the fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, in which bodhisattva great beings could be established.

source: །གང་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གནས་པར་འགྱུར་བའི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་ངོ་བོ་ཉིད་མེད་དོ།
en: There is no essential nature of [any of the goals], up to and including all-aspect omniscience, in which bodhisattva great beings could be established. {Ki.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་དགེ་སྦྱོང་དང་བྲམ་ཟེ་འདི་དག་ནི་ཤེས་པར་བྱ་བ་ཤེས་པའོ། །བལྟ་བར་བྱ་བ་མཐོང་བའོ། །ཡང་དག་པར་ལྟ་བའི་གདགས་པ་འདོགས་སོ་ཞེས་འདི་ལས་ཕྱི་རོལ་པའི་དགེ་སྦྱོང་དང་བྲམ་ཟེ་གཞན་དག་གི་ངོར་མི་ལྟ་སྟེ།
en: IV: 143} “Moreover, Subhūti, bodhisattva great beings are not beholden to virtuous ascetics and brāhmins of other [non-Buddhist] persuasions, saying that those virtuous ascetics and brāhmins know what should be known, see what should be seen, or conceive of the correct view.

source: དེ་ནི་གནས་མེད་ཅིང་ཐེ་ཚོམ་མི་ཟའོ།
en: That would be impossible! They do not have doubts.

source: །ཚུལ་ཁྲིམས་དང་བརྟུལ་ཞུགས་མི་སྙེམས་ལྟ་བ་ངན་པར་མི་ལྟུང་།
en: They do not overestimate or fall into wrong views concerning their ethical discipline and ascetic practices.

source: བཀྲ་ཤིས་དང་ལྟས་ཀྱིས་གཙང་བར་མི་འདོགས་ཏེ།
en: They do not conceive of purity [merely] on the basis of auspicious ceremonies and omens.

source: ལྷ་གཞན་ལ་ཕྱག་མི་འཚལ་ཞིང་།
en: They do not pay homage to strange gods.

source: མེ་ཏོག་གམ་ཕྲེང་བའམ་སྤོས་སམ་བྱུག་པའམ་ཕྱེ་མ་འམ་གོས་སམ། གདུགས་སམ་རྒྱལ་མཚན་ནམ། བ་དན་དག་དེ་ལ་སྦྱིན་ཞིང་བྱ་བར་མི་སེམས་ཏེ།
en: They do not offer them flowers, garlands, perfume, unguents, powders, clothing, parasols, victory banners, or ribbons, and they do not consider doing so.

source: རབ་འབྱོར་རྣམ་པ་དེ་དག་དང་མཚན་མ་དེ་དག་དང་། ཚུལ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱའོ།
en: Subhūti, one should know that bodhisattva great beings who possess these attributes, indications, and signs are irreversible. “

source: རབ་འབྱོར་གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སེམས་ཅན་དམྱལ་བར་མི་སྐྱེ།
en: Moreover, Subhūti, bodhisattva great beings who are irreversible will not be reborn among denizens of the hells.

source: བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་མི་སྐྱེ།
en: They will not be reborn in the animal realm.

source: གཤིན་རྗེའི་འཇིག་རྟེན་དུ་མི་སྐྱེ།
en: They will not be reborn in the world of Yama.

source: མི་ཁོམ་པ་བརྒྱད་པོའི་བར་གྱི་ནང་དུ་མི་སྐྱེ་ཞིང་།
en: They will not be reborn within the eight unfavorable states with no opportunity [to practice the Dharma].

source: བུད་མེད་དུ་འགྱུར་བ་ཡོངས་སུ་མི་འཛིན་ཏེ།
en: Nor will they assume the physical form of a woman.

source: རབ་འབྱོར་རྣམ་པ་དེ་དག་དང་། ཚུལ་དེ་དག་དང་། མཚན་མ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱའོ།
en: Subhūti, one should know that bodhisattva great beings who possess these attributes, indications, and signs are irreversible. “

source: །རབ་འབྱོར་གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་བཟུང་ཞིང་སྤྱོད་དེ།
en: Moreover, Subhūti, bodhisattva great beings who are irreversible adopt and practice the ways of the ten virtuous actions.

source: བདག་གིས་ཀྱང་སྲོག་གཅོད་པ་སྤངས་ཤིང་གཞན་ཡང་སྲོག་གཅོད་པ་སྤོང་བ་ལ་ཡང་དག་པར་བསྐུལ་བ་ཡིན།
en: They themselves will have abstained from killing living creatures, and they also encourage others to successfully abstain from killing living creatures.

source: སྲོག་གཅོད་པ་སྤང་བའི་ལེགས་པ་བརྗོད་པ་ཡིན།
en: They praise abstinence from killing living creatures.

source: གཞན་གང་གིས་སྲོག་གཅོད་པ་སྤངས་བ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བ་ཡིན། བདག་གིས་ཀྱང་མ་བྱིན་པར་ལེན་པ་དང་།
en: They praise and take empathetic delight in others who have abstained from killing living creatures.

source: འདོད་པས་ལོག་པར་གཡེམ་པ་དང་། བརྫུན་དུ་སྨྲ་བ་དང་། ཕྲ་མ་དང་ཞེ་གཅོད་པ་དང་། ཚིག་ཀྱལ་པ་དང་། ཆགས་སེམས་དང་།
en: They themselves will have abstained from stealing, sexual misconduct, telling lies, slander, harsh words, nonsensical chatter, covetousness, malice, and wrong views, and they also encourage others to abstain from wrong views [and so forth].

source: གནོད་སེམས་དང་།
en: They praise abstention from wrong views [and so forth].

source: ལོག་པར་ལྟ་བ་སྤོངས་ཤིང་གཞན་ཡང་ལོག་པར་ལྟ་བ་སྤོང་བ་ལ་ཡང་དག་པར་བསྐུལ་བ་ཡིན། ལོག་པར་ལྟ་བ་སྤོང་བའི་ལེགས་པ་བརྗོད་པ་ཡིན། གཞན་གང་གིས་ལོག་པར་ལྟ་བ་སྤངས་བདེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བ་ཡིན་ཏེ།
en: They praise and take empathetic delight in others abstaining from wrong views [and so forth].

source: །རབ་འབྱོར་གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་རྨི་ལམ་ན་ཡང་མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་མི་དམིགས་ན། སད་པ་ན་ལྟ་ཅི་སྨོས་ཏེ། རབ་འབྱོར་རྣམ་པ་དེ་དག་དང་། ཚུལ་དེ་དག་དང་།
en: Moreover, Subhūti, bodhisattva great beings who are irreversible do not apprehend the ways of the ten nonvirtuous actions, even in their dreams, let alone when they are awake.

source: མཚན་མ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱའོ། །རབ་འབྱོར་གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ནམ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Subhūti, one should know that bodhisattva great beings who possess these attributes, indications, and signs are irreversible. {

source: བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པ་དེའི་ཚེ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཕྱིར་སྦྱིན་པ་དེ་ཡོངས་སུ་གཏོང་ངོ་། །ཚུལ་ཁྲིམས་སྲུང་ངོ་། །བཟོད་པ་བསྒོམ་མོ། །བརྩོན་འགྲུས་རྩོམ་མོ།
en: IV: 144} “Moreover, Subhūti, when bodhisattva great beings who are irreversible dwell in the perfection of generosity, and when they dwell in the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, at that time they dispense gifts for the sake of all beings, they maintain ethical discipline, they cultivate tolerance, they undertake perseverance, they are absorbed in meditative concentration, and they cultivate wisdom.

source: །བསམ་གཏན་ལ་མཉམ་པར་གཞོག་གོ། །ཤེས་རབ་བསྒོམ་མོ་རབ་འབྱོར་རྣམ་པ་དེ་དག་དང་། ཚུལ་དེ་དག་དང་མཚན་མ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱའོ།
en: Subhūti, you should know that bodhisattva great beings who possess these attributes, indications, and signs are irreversible. “

source: །རབ་འབྱོར་གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་མདོ་དང་། དབྱངས་ཀྱིས་བསྙད་པ་དང་། ལུང་བསྟན་པ་དང་། ཚིགས་སུ་བཅད་པ་དང་། ཆེད་དུ་བརྗོད་པ་དང་། གླེང་གཞི་དང་། འདི་ལྟར་འདས་པ་དང་། སྐྱེས་པའི་རབས་དང་།
en: Moreover, Subhūti, bodhisattva great beings who are irreversible have mastered, for the purpose of giving the Dharma, the categories of the teachings, which include the discourses, the sayings in prose and verse, the prophetic declarations, the verses, the aphorisms, the contexts, the quotations, the tales of past lives, the most extensive teachings, the narratives, and the established instructions.

source: ཤིན་དུ་རྒྱས་པ་དང་། ཆོས་རྨད་དུ་བྱུང་བ་དང་། རྟོགས་པ་བརྗོད་པ་དང་། གཏན་ལ་དབབ་པ་བསྟན་པའི་ཆོས་དེ་དག་ཆོས་ཀྱི་སྦྱིན་པ་བྱ་བའི་དོན་དུ་ཀུན་ཆུབ་པར་བྱས་ནས། དེ་ཆོས་ཀྱི་སྦྱིན་པ་དེ་ཡོངས་སུ་གཏོང་བའི་ཚེ་འདི་སྙམ་དུ་ཆོས་ཀྱི་སྦྱིན་པ་འདིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག་ཅེས་བསམ་ནས།
en: Consequently, when they dispense the gift of the Dharma, they think, ‘May the wishes of all beings be fulfilled by means of this gift of the Dharma!’

source: དེ་ཆོས་ཀྱི་སྦྱིན་པ་དེ་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་བསྔོ་སྟེ།
en: Making common cause with all beings, they dedicate that gift of the Dharma toward unsurpassed, complete enlightenment.

source: རབ་འབྱོར་རྣམ་པ་དེ་དག་དང་ཚུལ་དེ་དག་དང་མཚན་མ་དེ་དག་དང་ལྡན་པའི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱའོ།
en: Subhūti, you should know that bodhisattva great beings who possess these attributes, indications, and signs are irreversible. “

source: །རབ་འབྱོར་གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཆོས་ཟབ་མོ་ལ་ནེམ་ནུར་མེད། ཐེ་ཙོམ་མེད། ཡིད་གཉིས་མེད་དོ།
en: Moreover, Subhūti, bodhisattva great beings who are irreversible have no doubt, indecision, or hesitation with regard to the profound attributes.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་ན་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཟབ་མོ་ལ་ནེམ་ནུར་མ་མཆིས། ཐེ་ཙོམ་མཆིས། ཡིད་གཉིས་མ་མཆིས་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, why do bodhisattva great beings who are irreversible have no doubt, indecision, or hesitation with regard to the profound attributes?” “

source: རབ་འབྱོར་དེ་ནི་འདི་ལྟར་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། ཆོས་གང་ཡང་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་མེད་དེ། གང་ལ་ནེམ་ནུར་རམ། ཡིད་གཉིས་སམ། ཐེ་ཙོམ་དུ་འགྱུར་བའི་གཟུགས་སམ། ཚོར་བ་འམ་འདུ་ཤེས་སམ་འདུ་བྱེད་དམ། རྣམ་པར་ཤེས་པའམ། སྐྱེ་མཆེད་དམ་ཁམས་སམ། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་འམ། ཕ་རོལ་དུ་ཕྱིན་པའམ། སྟོང་པ་ཉིད་དམ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སམ། འཕགས་པའི་བདེན་པའམ།
en: Subhūti,” replied the Blessed One, “it is because bodhisattva great beings who are irreversible do not observe anything at all with respect to which they might have doubt, indecision, or hesitation.

source: བསམ་གཏན་ནམ་ཚད་མེད་པའམ། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པའམ། རྣམ་པར་ཐར་པའམ་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པའམ། སྟོང་པ་ཉིད་དམ། མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པའམ་ཏིང་ངེ་འཛིན་ཏམ། གཟུངས་ཀྱི་སྒོ་འམ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་སམ། མི་འཇིགས་པའམ། སོ་སོ་ཡང་དག་པར་རིག་པའམ། བྱམས་པ་ཆེན་པོའམ་སྙིང་རྗེ་ཆེན་པོའམ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའམ།
en: That is to say, they do not observe physical forms, feelings, perceptions, formative predispositions, consciousness, the sense fields, the sensory elements, the links of dependent origination, any of the perfections, any of the aspects of emptiness, the factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, the distinct qualities of the buddhas, or [the goals], up to and including unsurpassed, complete enlightenment.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །རབ་འབྱོར་རྣམ་པ་དེ་དག་དང་། ཚུལ་དེ་དག་དང་མཚན་མ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱའོ།
en: Subhūti, you should know that bodhisattva great beings who possess these attributes, indications, and signs are irreversible. {

source: །རབ་འབྱོར་གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ལུས་ཀྱི་ལས་འཇམ་པ་དང་ལྡན་པ་ཡིན། ངག་གི་ལས་འཇམ་པ་དང་ལྡན་པ་ཡིན། ཡིད་ཀྱི་ལས་འཇམ་པ་དང་ལྡན་པ་ཡིན་ཏེ།
en: Ki.IV: 145} “Moreover, Subhūti, bodhisattva great beings who are irreversible undertake gentle physical actions, gentle verbal actions, and gentle mental actions.

source: །རབ་འབྱོར་གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བྱམས་པའི་ལུས་ཀྱི་ལས་དང་། བྱམས་པའི་ངག་གིས་ལས་དང་། བྱམས་པའི་ཡིད་ཀྱི་ལས་དང་ལྡན་པ་ཡིན་ཏེ།
en: Moreover, Subhūti, the bodhisattva great beings who are irreversible undertake physical actions imbued with loving kindness, verbal actions imbued with loving kindness, and mental actions imbued with loving kindness.

source: རབ་འབྱོར་རྣམ་པ་དེ་དག་དང་ཚུལ་དེ་དག་དང་མཚན་མ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱའོ།
en: Subhūti, you should know that bodhisattva great beings who possess these attributes, indications, and signs are irreversible. “

source: །རབ་འབྱོར་གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་འདི་ལྟ་སྟེ། འདོད་པ་ལ་མོས་པ་དང་། གནོད་སེམས་དང་རྨུགས་པ་དང་གཉིད་དང་རྒོད་པ་དང་འགྱོད་པ་དང་། ཐེ་ཚོམ་གྱི་སྒྲིབ་པ་ལྔ་པོ་འདི་དག་དང་ལྷན་ཅིག་ཏུ་མི་གནས་ཏེ།
en: Moreover, Subhūti, bodhisattva great beings who are irreversible instinctively do not dwell in the five obscurations, comprising longing for sensual pleasure, harmful intention, dullness and sleep, agitation and regret, and doubt.

source: །རབ་འབྱོར་གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བག་ལ་ཉལ་བ་ཐམས་ཅད་མེད་དེ།
en: Moreover, Subhūti, bodhisattva great beings who are irreversible are in every respect without all latent impulses.

source: རབ་འབྱོར་རྣམ་པ་དེ་དག་དང་ཚུལ་དེ་དག་དང་། མཚན་མ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱའོ།
en: Subhūti, you should know that bodhisattva great beings who possess these attributes, indications, and signs are irreversible. “

source: །རབ་འབྱོར་གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་འགྲོ་ཞིང་འོང་ཡང་། ནོར་བའི་སེམས་ཀྱིས་མི་འགྲོ། །ནོར་པའི་སེམས་ཀྱིས་མི་འོང་སྟེ།
en: Moreover, Subhūti, whether bodhisattva great beings who are irreversible are going or coming, they do not go with a confused mind and they do not come with a confused mind.

source: དེ་ལ་འགྲོ་བའམ་འོང་ན་ཡང་། དྲན་པ་ཉེ་བར་གཞག་ཅིང་འགྲོ། དྲན་པ་ཉེ་བར་གཞག་ཅིང་འོང་སྟེ།
en: Whether they are going or coming, they go in accordance with the applications of mindfulness, and they come in accordance with the applications of mindfulness.

source: དེ་དྲན་བཞིན་དུ་འགྲོ།
en: They set out and return mindfully.

source: །དྲན་བཞིན་དུ་འོང་།
en: They come mindfully.

source: དྲན་བཞིན་དུ་འཆག །དྲན་བཞིན་དུ་སྡོད། དྲན་བཞིན་དུ་འདུག །དྲན་བཞིན་དུ་ཉལ་ཏེ།
en: They walk mindfully, stand mindfully, sit mindfully, and lie down mindfully.

source: དེ་འཕྲལ་ལས་ལས་རྐང་པ་མི་འདེག །འཕྲལ་ལ་ས་ལ་རྐང་པ་མི་འཇོག་སྟེ།
en: They do not raise their feet from the ground impulsively, and they do not put their feet on the ground impulsively.

source: དྲན་བཞིན་དུ་རྐང་པ་འདེག །དྲན་བཞིན་དུ་རྐང་པ་འཇོག་ཅིང་དེ་སའི་ཕྱོགས་མཐོང་བཞིན་དུ་འགྲོ་སྟེ། རབ་འབྱོར་རྣམ་པ་དེ་དག་དང་།
en: They raise their feet from the ground mindfully, they put their feet on the ground mindfully, and they move while looking where they are going.

source: ཚུལ་དེ་དག་དང་མཚན་མ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱའོ།
en: Subhūti, you should know that bodhisattva great beings who possess these attributes, indications, and signs are irreversible. {

source: །རབ་འབྱོར་གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་གོས་ཀྱི་ཚགས་ལ་སྨད་དུ་མེད་པ་ཡིན།
en: Ki.IV: 146} “Moreover, Subhūti, the condition of the robes belonging to bodhisattva great beings who are irreversible is not unkempt.

source: རབ་འབྱོར་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་གཙང་སྦྲའི་སྤྱོད་པ་དང་ལྡན་ཏེ།
en: Subhūti, the conduct of bodhisattva great beings who are irreversible is pure.

source: གཙང་ཞིང་དྲིང་བ་མེད་ལ་རྡུལ་དང་དྲི་མ་དང་བྲལ་ཞིང་ནད་ཉུང་བ་ཡིན་ཏེ།
en: They are clean and without bad odors. They themselves have few ailments, and they are free from dust and stains.

source: །རབ་འབྱོར་གཞན་ཡང་མིར་གྱུར་པ་རྣམས་ཀྱི་ལུས་ལ་སྲིན་བུའི་རིགས་སྟོང་ཕྲག་བརྒྱད་ཅུ་ལུས་དེ་ཉིད་ལ་ཟ་བ་ཡོད་པ་དེ་དག་ཀྱང་། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལུས་ལ་ཐམས་ཅད་དུ་ཐམས་ཅད། རྣམ་པ་ཐམས་ཅད་དུ་ཐམས་ཅད་མེད་དོ།
en: Moreover, Subhūti, the bodies of bodhisattva great beings who are irreversible are entirely and in all respects even without the eighty thousand kinds of minute organisms that are present within the human body, and consume it.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དགེ་བའི་རྩ་བ་དེ་དག་འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པ། འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་མཆོག་ཏུ་གྱུར་པ་སྟེ།
en: If you ask why, Subhūti, it is because the roots of virtue of bodhisattva great beings surpass all worlds, and are supreme in all worlds.

source: དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེའི་ལུས་ལ་སྲིན་བུའི་རིགས་སྟོང་ཕྲག་བརྒྱད་ཅུ་པོ་དེ་དག་མེད་དེ།
en: For this reason, the bodies of those bodhisattva great beings are without those eighty thousand kinds of minute organisms. “

source: རབ་འབྱོར་ཇི་ལྟ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དགེ་བའི་རྩ་བ་དེ་དག་རྣམ་པར་འཕེལ་བ་དེ་ལྟ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལུས་ཡོངས་སུ་དག་པ་ཡོངས་སུ་འཛིན་ཏོ། །ངག་ཡོངས་སུ་དག་པ་དང་། སེམས་ཡོངས་སུ་དག་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: Subhūti, the more those roots of virtue of bodhisattva great beings increase, the more will those bodhisattva great beings assume physical purity and assume verbal and mental purity.

source: །རབ་འབྱོར་རྣམ་པ་དེ་དག་དང་ཚུལ་དེ་དག་དང་། མཚན་མ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱའོ།
en: Subhūti, you should know that bodhisattva great beings who possess these attributes, indications, and signs are irreversible.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལུས་ཡོངས་སུ་དག་པ་ལགས།
en: Then the venerable Subhūti asked the Blessed One, “Blessed Lord, how are bodhisattva great beings physically pure?

source: ངག་ཡོངས་སུ་དག་པ་ལགས། སེམས་ཡོངས་སུ་དག་པ་ལགས།
en: How are they verbally pure and how are they mentally pure?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཇི་ལྟ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དགེ་བའི་རྩ་བ་དེ་དག་རྣམ་པར་འཕེལ་བ་དེ་ལྟ་དེ་ལྟར་དགེ་བའི་རྩ་བ་དེ་དག་གིས་ལུས་དང་ངག་དང་སེམས་མི་དྲང་བ་དང་།
en: Subhūti,” replied the Blessed One, “the more those roots of virtue of bodhisattva great beings increase, the more will their physical, verbal, and mental deformations, and their physical, verbal, and mental crookedness be purified in accordance with those roots of virtue.

source: ལུས་དང་ངག་དང་སེམས་ཀྱི་གྱ་གྱུ་ཡོངས་སུ་བྱང་བར་འགྱུར་ཏེ། དེ་ཡང་དེ་ལྟ་དེ་ལྟར་ལུས་ཀྱིས་ལེགས་པར་སྤྱད་པ་རྣམ་པ་གསུམ་སྤྱོད་དོ། །ངག་གིས་ལེགས་པར་སྤྱད་པ་རྣམ་པ་བཞི་སྤྱོད་དོ། །ཡིད་ཀྱིས་ལེགས་པར་སྤྱད་པ་རྣམ་པ་གསུམ་སྤྱོད་དེ། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལུས་དང་ངག་དང་སེམས་ཡོངས་སུ་དག་པའོ།
en: Insofar as they physically practice the three modes of excellent conduct, verbally practice the four modes of excellent conduct, and mentally practice the three modes of excellent conduct, the body, speech, and mind of those bodhisattva great beings will be purified.

source: །དེ་ལུས་དང་ངག་དང་སེམས་ཡོངས་སུ་དག་པ་དེས། ཉན་ཐོས་ཀྱི་ས་དང་རང་སངས་རྒྱས་ཀྱི་ས་ལས་འདའ་ཡང་། ཡང་དག་པའི་མཐའ་མངོན་དུ་མི་བྱེད་དེ།
en: Those who possess physical, verbal, and mental purity transcend the level of the śrāvakas and also the level of the pratyekabuddhas, and they do not actualize the very limit of reality. {

source: རབ་འབྱོར་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལུས་དང་ངག་དང་སེམས་ཡོངས་སུ་དག་པར་རིག་པར་བྱ་སྟེ།
en: Ki.IV: 147} Subhūti, you should know this indeed to be the physical, verbal, and mental purity that those bodhisattvas have.

source: རབ་འབྱོར་རྣམ་པ་དེ་དག་དང་ཚུལ་དེ་དག་དང་མཚན་མ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱའོ་རབ་འབྱོར་གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཁེ་དང་བཀུར་སྟི་དང་ཚིགས་སུ་བཅད་པ་ལྷུར་ལེན་པ་མ་ཡིན།
en: Subhūti, you should know that bodhisattva great beings who possess these attributes, indications, and signs are irreversible. “Moreover, Subhūti, bodhisattva great beings who are irreversible are not attracted to profit, veneration, or eulogistic verses.

source: བསོད་སྙོམས་ལྷུར་ལེན་པ་མ་ཡིན།
en: They are not attracted to alms.

source: ཆོས་གོས་གསུམ་པའི་བར་དུ་ལྷུར་ལེན་པ་མ་ཡིན་ཞིང་དེ་སྦྱངས་པའི་ཡོན་ཏན་བཅུ་གཉིས་ཀྱང་ཡང་དག་པར་བླངས་ཏེ་སྤྱོད་དོ། །རབ་འབྱོར་རྣམ་པ་དེ་དག་དང་ཚུལ་དེ་དག་དང་།
en: They are not attracted to the three religious robes [and so forth], but they assume and practice the twelve ascetic virtues.

source: མཚན་མ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱའོ།
en: Subhūti, you should know that bodhisattva great beings who possess these attributes, indications, and signs are irreversible. “

source: །རབ་འབྱོར་གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་སེར་སྣའི་སེམས་སྐྱེ་བ་མེད་དོ། །ཚུལ་ཁྲིམས་ངན་པའི་སེམས་སྐྱེ་བ་མེད་དོ། །འཁྲུགས་པའི་སེམས་སྐྱེ་བ་མེད་དོ། །ལེ་ལོའི་སེམས་སྐྱེ་བ་མེད་དོ། །མཉམ་པར་མ་བཞག་པའི་སེམས་སྐྱེ་བ་མེད་དོ།
en: Moreover, Subhūti, in bodhisattva great beings who are irreversible, thoughts of miserliness do not arise, thoughts of degenerate morality do not arise, thoughts of agitation do not arise, thoughts of indolence do not arise, thoughts of nonabsorption do not arise, thoughts of stupidity do not arise, and thoughts of envy do not arise.

source: །ཤེས་རབ་འཆལ་པའི་སེམས་སྐྱེ་བ་མེད་དོ། །ཕྲག་དོག་གི་སེམས་སྐྱེ་བ་མེད་དོ། །རབ་འབྱོར་རྣམ་པ་དེ་དག་དང་། ཚུལ་དེ་དག་དང་མཚན་མ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱའོ།
en: Subhūti, you should know that bodhisattva great beings who possess these attributes, indications, and signs are irreversible. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱིར་མི་ལྡོག་པ་ནི་བློ་བརྟན་པ་ཡིན། བློ་ཟབ་པ་ཡིན།
en: Moreover, Subhūti, bodhisattva great beings who are irreversible are of steadfast intelligence and of profound intelligence.

source: གུས་པར་གཞན་ལ་ཆོས་ཉན་པ་ཡིན། གཞན་ལས་ཆོས་གང་ཅི་ཐོས་ཀྱང་། དེ་ཐམས་ཅད་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡང་དག་པར་སྒྲུབ་པ་ཡིན།
en: They respectfully listen to the Dharma from others, and whatever doctrines they hear from others, they establish them all through the perfection of wisdom.

source: འཇིག་རྟེན་པའི་བྱ་བ་གང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བརྟེན་ཏེ། ཆོས་ཉིད་ཀྱིས་ཡང་དག་པར་སྒྲུབ་ཅིང་།
en: All those activities that are mundane, relying on the perfection of wisdom they also bring into accordance with reality.

source: ཆོས་གང་ཆོས་ཀྱི་དབྱིངས་དང་མི་འབྱོར་པ་དེ་ལྟ་བུ་གང་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: They do not observe anything at all that is not integrated within the realm of phenomena.

source: དེ་ཐམས་ཅད་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་འབྱོར་བར་ཡང་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་ཡིན་ཏེ།
en: They observe rather that all these phenomena are integrated with the perfection of wisdom.

source: རབ་འབྱོར་དེ་དག་ནི་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཕྱིར་མི་ལྡོག་པའི་མཚན་ཉིད་དུ་རིག་པར་བྱའོ།
en: Subhūti, you should know these to be the defining characteristics bodhisattva great beings who are irreversible. “
